testy_all/k6_baseline_full_report.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /baseline.js
        output: -

     scenarios: (100.00%) 1 scenario, 100 max VUs, 5m30s max duration (incl. graceful stop):
              * default: 100 looping VUs for 5m0s (gracefulStop: 30s)


running (0m01.0s), 100/100 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 100 VUs  0m01.0s/5m0s

running (0m02.0s), 100/100 VUs, 0 complete and 0 interrupted iterations
default   [   1% ] 100 VUs  0m02.0s/5m0s

running (0m03.0s), 100/100 VUs, 0 complete and 0 interrupted iterations
default   [   1% ] 100 VUs  0m03.0s/5m0s

running (0m04.0s), 100/100 VUs, 0 complete and 0 interrupted iterations
default   [   1% ] 100 VUs  0m04.0s/5m0s

running (0m05.0s), 100/100 VUs, 12 complete and 0 interrupted iterations
default   [   2% ] 100 VUs  0m05.0s/5m0s

running (0m06.0s), 100/100 VUs, 30 complete and 0 interrupted iterations
default   [   2% ] 100 VUs  0m06.0s/5m0s

running (0m07.0s), 100/100 VUs, 40 complete and 0 interrupted iterations
default   [   2% ] 100 VUs  0m07.0s/5m0s

running (0m08.0s), 100/100 VUs, 52 complete and 0 interrupted iterations
default   [   3% ] 100 VUs  0m08.0s/5m0s

running (0m09.0s), 100/100 VUs, 70 complete and 0 interrupted iterations
default   [   3% ] 100 VUs  0m09.0s/5m0s

running (0m10.0s), 100/100 VUs, 80 complete and 0 interrupted iterations
default   [   3% ] 100 VUs  0m10.0s/5m0s

running (0m11.0s), 100/100 VUs, 92 complete and 0 interrupted iterations
default   [   4% ] 100 VUs  0m11.0s/5m0s

running (0m12.0s), 100/100 VUs, 100 complete and 0 interrupted iterations
default   [   4% ] 100 VUs  0m12.0s/5m0s

running (0m13.0s), 100/100 VUs, 112 complete and 0 interrupted iterations
default   [   4% ] 100 VUs  0m13.0s/5m0s

running (0m14.0s), 100/100 VUs, 129 complete and 0 interrupted iterations
default   [   5% ] 100 VUs  0m14.0s/5m0s

running (0m15.0s), 100/100 VUs, 140 complete and 0 interrupted iterations
default   [   5% ] 100 VUs  0m15.0s/5m0s

running (0m16.0s), 100/100 VUs, 152 complete and 0 interrupted iterations
default   [   5% ] 100 VUs  0m16.0s/5m0s

running (0m17.0s), 100/100 VUs, 168 complete and 0 interrupted iterations
default   [   6% ] 100 VUs  0m17.0s/5m0s

running (0m18.0s), 100/100 VUs, 179 complete and 0 interrupted iterations
default   [   6% ] 100 VUs  0m18.0s/5m0s

running (0m19.0s), 100/100 VUs, 190 complete and 0 interrupted iterations
default   [   6% ] 100 VUs  0m19.0s/5m0s

running (0m20.0s), 100/100 VUs, 201 complete and 0 interrupted iterations
default   [   7% ] 100 VUs  0m20.0s/5m0s

running (0m21.0s), 100/100 VUs, 218 complete and 0 interrupted iterations
default   [   7% ] 100 VUs  0m21.0s/5m0s

running (0m22.0s), 100/100 VUs, 228 complete and 0 interrupted iterations
default   [   7% ] 100 VUs  0m22.0s/5m0s

running (0m23.0s), 100/100 VUs, 240 complete and 0 interrupted iterations
default   [   8% ] 100 VUs  0m23.0s/5m0s

running (0m24.0s), 100/100 VUs, 251 complete and 0 interrupted iterations
default   [   8% ] 100 VUs  0m24.0s/5m0s

running (0m25.0s), 100/100 VUs, 262 complete and 0 interrupted iterations
default   [   8% ] 100 VUs  0m25.0s/5m0s

running (0m26.0s), 100/100 VUs, 272 complete and 0 interrupted iterations
default   [   9% ] 100 VUs  0m26.0s/5m0s

running (0m27.0s), 100/100 VUs, 283 complete and 0 interrupted iterations
default   [   9% ] 100 VUs  0m27.0s/5m0s

running (0m28.0s), 100/100 VUs, 299 complete and 0 interrupted iterations
default   [   9% ] 100 VUs  0m28.0s/5m0s

running (0m29.0s), 100/100 VUs, 305 complete and 0 interrupted iterations
default   [  10% ] 100 VUs  0m29.0s/5m0s

running (0m30.0s), 100/100 VUs, 319 complete and 0 interrupted iterations
default   [  10% ] 100 VUs  0m30.0s/5m0s

running (0m31.0s), 100/100 VUs, 330 complete and 0 interrupted iterations
default   [  10% ] 100 VUs  0m31.0s/5m0s

running (0m32.0s), 100/100 VUs, 342 complete and 0 interrupted iterations
default   [  11% ] 100 VUs  0m32.0s/5m0s

running (0m33.0s), 100/100 VUs, 355 complete and 0 interrupted iterations
default   [  11% ] 100 VUs  0m33.0s/5m0s

running (0m34.0s), 100/100 VUs, 366 complete and 0 interrupted iterations
default   [  11% ] 100 VUs  0m34.0s/5m0s

running (0m35.0s), 100/100 VUs, 379 complete and 0 interrupted iterations
default   [  12% ] 100 VUs  0m35.0s/5m0s

running (0m36.0s), 100/100 VUs, 395 complete and 0 interrupted iterations
default   [  12% ] 100 VUs  0m36.0s/5m0s

running (0m37.0s), 100/100 VUs, 407 complete and 0 interrupted iterations
default   [  12% ] 100 VUs  0m37.0s/5m0s

running (0m38.0s), 100/100 VUs, 419 complete and 0 interrupted iterations
default   [  13% ] 100 VUs  0m38.0s/5m0s

running (0m39.0s), 100/100 VUs, 429 complete and 0 interrupted iterations
default   [  13% ] 100 VUs  0m39.0s/5m0s

running (0m40.0s), 100/100 VUs, 445 complete and 0 interrupted iterations
default   [  13% ] 100 VUs  0m40.0s/5m0s

running (0m41.0s), 100/100 VUs, 459 complete and 0 interrupted iterations
default   [  14% ] 100 VUs  0m41.0s/5m0s

running (0m42.0s), 100/100 VUs, 470 complete and 0 interrupted iterations
default   [  14% ] 100 VUs  0m42.0s/5m0s

running (0m43.0s), 100/100 VUs, 485 complete and 0 interrupted iterations
default   [  14% ] 100 VUs  0m43.0s/5m0s

running (0m44.0s), 100/100 VUs, 496 complete and 0 interrupted iterations
default   [  15% ] 100 VUs  0m44.0s/5m0s

running (0m45.0s), 100/100 VUs, 507 complete and 0 interrupted iterations
default   [  15% ] 100 VUs  0m45.0s/5m0s

running (0m46.0s), 100/100 VUs, 518 complete and 0 interrupted iterations
default   [  15% ] 100 VUs  0m46.0s/5m0s

running (0m47.0s), 100/100 VUs, 529 complete and 0 interrupted iterations
default   [  16% ] 100 VUs  0m47.0s/5m0s

running (0m48.0s), 100/100 VUs, 541 complete and 0 interrupted iterations
default   [  16% ] 100 VUs  0m48.0s/5m0s

running (0m49.0s), 100/100 VUs, 556 complete and 0 interrupted iterations
default   [  16% ] 100 VUs  0m49.0s/5m0s

running (0m50.0s), 100/100 VUs, 567 complete and 0 interrupted iterations
default   [  17% ] 100 VUs  0m50.0s/5m0s

running (0m51.0s), 100/100 VUs, 577 complete and 0 interrupted iterations
default   [  17% ] 100 VUs  0m51.0s/5m0s

running (0m52.0s), 100/100 VUs, 589 complete and 0 interrupted iterations
default   [  17% ] 100 VUs  0m52.0s/5m0s

running (0m53.0s), 100/100 VUs, 599 complete and 0 interrupted iterations
default   [  18% ] 100 VUs  0m53.0s/5m0s

running (0m54.0s), 100/100 VUs, 616 complete and 0 interrupted iterations
default   [  18% ] 100 VUs  0m54.0s/5m0s

running (0m55.0s), 100/100 VUs, 626 complete and 0 interrupted iterations
default   [  18% ] 100 VUs  0m55.0s/5m0s

running (0m56.0s), 100/100 VUs, 637 complete and 0 interrupted iterations
default   [  19% ] 100 VUs  0m56.0s/5m0s

running (0m57.0s), 100/100 VUs, 648 complete and 0 interrupted iterations
default   [  19% ] 100 VUs  0m57.0s/5m0s

running (0m58.0s), 100/100 VUs, 659 complete and 0 interrupted iterations
default   [  19% ] 100 VUs  0m58.0s/5m0s

running (0m59.0s), 100/100 VUs, 676 complete and 0 interrupted iterations
default   [  20% ] 100 VUs  0m59.0s/5m0s

running (1m00.0s), 100/100 VUs, 687 complete and 0 interrupted iterations
default   [  20% ] 100 VUs  1m00.0s/5m0s

running (1m01.0s), 100/100 VUs, 697 complete and 0 interrupted iterations
default   [  20% ] 100 VUs  1m01.0s/5m0s

running (1m02.0s), 100/100 VUs, 710 complete and 0 interrupted iterations
default   [  21% ] 100 VUs  1m02.0s/5m0s

running (1m03.0s), 100/100 VUs, 723 complete and 0 interrupted iterations
default   [  21% ] 100 VUs  1m03.0s/5m0s

running (1m04.0s), 100/100 VUs, 737 complete and 0 interrupted iterations
default   [  21% ] 100 VUs  1m04.0s/5m0s

running (1m05.0s), 100/100 VUs, 747 complete and 0 interrupted iterations
default   [  22% ] 100 VUs  1m05.0s/5m0s

running (1m06.0s), 100/100 VUs, 757 complete and 0 interrupted iterations
default   [  22% ] 100 VUs  1m06.0s/5m0s

running (1m07.0s), 100/100 VUs, 768 complete and 0 interrupted iterations
default   [  22% ] 100 VUs  1m07.0s/5m0s

running (1m08.0s), 100/100 VUs, 779 complete and 0 interrupted iterations
default   [  23% ] 100 VUs  1m08.0s/5m0s

running (1m09.0s), 100/100 VUs, 796 complete and 0 interrupted iterations
default   [  23% ] 100 VUs  1m09.0s/5m0s

running (1m10.0s), 100/100 VUs, 807 complete and 0 interrupted iterations
default   [  23% ] 100 VUs  1m10.0s/5m0s

running (1m11.0s), 100/100 VUs, 817 complete and 0 interrupted iterations
default   [  24% ] 100 VUs  1m11.0s/5m0s

running (1m12.0s), 100/100 VUs, 826 complete and 0 interrupted iterations
default   [  24% ] 100 VUs  1m12.0s/5m0s

running (1m13.0s), 100/100 VUs, 831 complete and 0 interrupted iterations
default   [  24% ] 100 VUs  1m13.0s/5m0s

running (1m14.0s), 100/100 VUs, 837 complete and 0 interrupted iterations
default   [  25% ] 100 VUs  1m14.0s/5m0s

running (1m15.0s), 100/100 VUs, 847 complete and 0 interrupted iterations
default   [  25% ] 100 VUs  1m15.0s/5m0s

running (1m16.0s), 100/100 VUs, 867 complete and 0 interrupted iterations
default   [  25% ] 100 VUs  1m16.0s/5m0s

running (1m17.0s), 100/100 VUs, 877 complete and 0 interrupted iterations
default   [  26% ] 100 VUs  1m17.0s/5m0s

running (1m18.0s), 100/100 VUs, 887 complete and 0 interrupted iterations
default   [  26% ] 100 VUs  1m18.0s/5m0s

running (1m19.0s), 100/100 VUs, 897 complete and 0 interrupted iterations
default   [  26% ] 100 VUs  1m19.0s/5m0s

running (1m20.0s), 100/100 VUs, 912 complete and 0 interrupted iterations
default   [  27% ] 100 VUs  1m20.0s/5m0s

running (1m21.0s), 100/100 VUs, 926 complete and 0 interrupted iterations
default   [  27% ] 100 VUs  1m21.0s/5m0s

running (1m22.0s), 100/100 VUs, 936 complete and 0 interrupted iterations
default   [  27% ] 100 VUs  1m22.0s/5m0s

running (1m23.0s), 100/100 VUs, 946 complete and 0 interrupted iterations
default   [  28% ] 100 VUs  1m23.0s/5m0s

running (1m24.0s), 100/100 VUs, 957 complete and 0 interrupted iterations
default   [  28% ] 100 VUs  1m24.0s/5m0s

running (1m25.0s), 100/100 VUs, 974 complete and 0 interrupted iterations
default   [  28% ] 100 VUs  1m25.0s/5m0s

running (1m26.0s), 100/100 VUs, 983 complete and 0 interrupted iterations
default   [  29% ] 100 VUs  1m26.0s/5m0s

running (1m27.0s), 100/100 VUs, 996 complete and 0 interrupted iterations
default   [  29% ] 100 VUs  1m27.0s/5m0s

running (1m28.0s), 100/100 VUs, 1006 complete and 0 interrupted iterations
default   [  29% ] 100 VUs  1m28.0s/5m0s

running (1m29.0s), 100/100 VUs, 1016 complete and 0 interrupted iterations
default   [  30% ] 100 VUs  1m29.0s/5m0s

running (1m30.0s), 100/100 VUs, 1026 complete and 0 interrupted iterations
default   [  30% ] 100 VUs  1m30.0s/5m0s

running (1m31.0s), 100/100 VUs, 1036 complete and 0 interrupted iterations
default   [  30% ] 100 VUs  1m31.0s/5m0s

running (1m32.0s), 100/100 VUs, 1046 complete and 0 interrupted iterations
default   [  31% ] 100 VUs  1m32.0s/5m0s

running (1m33.0s), 100/100 VUs, 1057 complete and 0 interrupted iterations
default   [  31% ] 100 VUs  1m33.0s/5m0s

running (1m34.0s), 100/100 VUs, 1068 complete and 0 interrupted iterations
default   [  31% ] 100 VUs  1m34.0s/5m0s

running (1m35.0s), 100/100 VUs, 1083 complete and 0 interrupted iterations
default   [  32% ] 100 VUs  1m35.0s/5m0s

running (1m36.0s), 100/100 VUs, 1094 complete and 0 interrupted iterations
default   [  32% ] 100 VUs  1m36.0s/5m0s

running (1m37.0s), 100/100 VUs, 1104 complete and 0 interrupted iterations
default   [  32% ] 100 VUs  1m37.0s/5m0s

running (1m38.0s), 100/100 VUs, 1116 complete and 0 interrupted iterations
default   [  33% ] 100 VUs  1m38.0s/5m0s

running (1m39.0s), 100/100 VUs, 1127 complete and 0 interrupted iterations
default   [  33% ] 100 VUs  1m39.0s/5m0s

running (1m40.0s), 100/100 VUs, 1144 complete and 0 interrupted iterations
default   [  33% ] 100 VUs  1m40.0s/5m0s

running (1m41.0s), 100/100 VUs, 1155 complete and 0 interrupted iterations
default   [  34% ] 100 VUs  1m41.0s/5m0s

running (1m42.0s), 100/100 VUs, 1165 complete and 0 interrupted iterations
default   [  34% ] 100 VUs  1m42.0s/5m0s

running (1m43.0s), 100/100 VUs, 1177 complete and 0 interrupted iterations
default   [  34% ] 100 VUs  1m43.0s/5m0s

running (1m44.0s), 100/100 VUs, 1189 complete and 0 interrupted iterations
default   [  35% ] 100 VUs  1m44.0s/5m0s

running (1m45.0s), 100/100 VUs, 1203 complete and 0 interrupted iterations
default   [  35% ] 100 VUs  1m45.0s/5m0s

running (1m46.0s), 100/100 VUs, 1215 complete and 0 interrupted iterations
default   [  35% ] 100 VUs  1m46.0s/5m0s

running (1m47.0s), 100/100 VUs, 1226 complete and 0 interrupted iterations
default   [  36% ] 100 VUs  1m47.0s/5m0s

running (1m48.0s), 100/100 VUs, 1241 complete and 0 interrupted iterations
default   [  36% ] 100 VUs  1m48.0s/5m0s

running (1m49.0s), 100/100 VUs, 1254 complete and 0 interrupted iterations
default   [  36% ] 100 VUs  1m49.0s/5m0s

running (1m50.0s), 100/100 VUs, 1265 complete and 0 interrupted iterations
default   [  37% ] 100 VUs  1m50.0s/5m0s

running (1m51.0s), 100/100 VUs, 1277 complete and 0 interrupted iterations
default   [  37% ] 100 VUs  1m51.0s/5m0s

running (1m52.0s), 100/100 VUs, 1290 complete and 0 interrupted iterations
default   [  37% ] 100 VUs  1m52.0s/5m0s

running (1m53.0s), 100/100 VUs, 1303 complete and 0 interrupted iterations
default   [  38% ] 100 VUs  1m53.0s/5m0s

running (1m54.0s), 100/100 VUs, 1314 complete and 0 interrupted iterations
default   [  38% ] 100 VUs  1m54.0s/5m0s

running (1m55.0s), 100/100 VUs, 1324 complete and 0 interrupted iterations
default   [  38% ] 100 VUs  1m55.0s/5m0s

running (1m56.0s), 100/100 VUs, 1335 complete and 0 interrupted iterations
default   [  39% ] 100 VUs  1m56.0s/5m0s

running (1m57.0s), 100/100 VUs, 1345 complete and 0 interrupted iterations
default   [  39% ] 100 VUs  1m57.0s/5m0s

running (1m58.0s), 100/100 VUs, 1356 complete and 0 interrupted iterations
default   [  39% ] 100 VUs  1m58.0s/5m0s

running (1m59.0s), 100/100 VUs, 1369 complete and 0 interrupted iterations
default   [  40% ] 100 VUs  1m59.0s/5m0s

running (2m00.0s), 100/100 VUs, 1384 complete and 0 interrupted iterations
default   [  40% ] 100 VUs  2m00.0s/5m0s

running (2m01.0s), 100/100 VUs, 1395 complete and 0 interrupted iterations
default   [  40% ] 100 VUs  2m01.0s/5m0s

running (2m02.0s), 100/100 VUs, 1405 complete and 0 interrupted iterations
default   [  41% ] 100 VUs  2m02.0s/5m0s

running (2m03.0s), 100/100 VUs, 1417 complete and 0 interrupted iterations
default   [  41% ] 100 VUs  2m03.0s/5m0s

running (2m04.0s), 100/100 VUs, 1430 complete and 0 interrupted iterations
default   [  41% ] 100 VUs  2m04.0s/5m0s

running (2m05.0s), 100/100 VUs, 1444 complete and 0 interrupted iterations
default   [  42% ] 100 VUs  2m05.0s/5m0s

running (2m06.0s), 100/100 VUs, 1454 complete and 0 interrupted iterations
default   [  42% ] 100 VUs  2m06.0s/5m0s

running (2m07.0s), 100/100 VUs, 1465 complete and 0 interrupted iterations
default   [  42% ] 100 VUs  2m07.0s/5m0s

running (2m08.0s), 100/100 VUs, 1475 complete and 0 interrupted iterations
default   [  43% ] 100 VUs  2m08.0s/5m0s

running (2m09.0s), 100/100 VUs, 1485 complete and 0 interrupted iterations
default   [  43% ] 100 VUs  2m09.0s/5m0s

running (2m10.0s), 100/100 VUs, 1500 complete and 0 interrupted iterations
default   [  43% ] 100 VUs  2m10.0s/5m0s

running (2m11.0s), 100/100 VUs, 1515 complete and 0 interrupted iterations
default   [  44% ] 100 VUs  2m11.0s/5m0s

running (2m12.0s), 100/100 VUs, 1525 complete and 0 interrupted iterations
default   [  44% ] 100 VUs  2m12.0s/5m0s

running (2m13.0s), 100/100 VUs, 1534 complete and 0 interrupted iterations
default   [  44% ] 100 VUs  2m13.0s/5m0s

running (2m14.0s), 100/100 VUs, 1535 complete and 0 interrupted iterations
default   [  45% ] 100 VUs  2m14.0s/5m0s

running (2m15.0s), 100/100 VUs, 1545 complete and 0 interrupted iterations
default   [  45% ] 100 VUs  2m15.0s/5m0s

running (2m16.0s), 100/100 VUs, 1555 complete and 0 interrupted iterations
default   [  45% ] 100 VUs  2m16.0s/5m0s

running (2m17.0s), 100/100 VUs, 1565 complete and 0 interrupted iterations
default   [  46% ] 100 VUs  2m17.0s/5m0s

running (2m18.0s), 100/100 VUs, 1575 complete and 0 interrupted iterations
default   [  46% ] 100 VUs  2m18.0s/5m0s

running (2m19.0s), 100/100 VUs, 1585 complete and 0 interrupted iterations
default   [  46% ] 100 VUs  2m19.0s/5m0s

running (2m20.0s), 100/100 VUs, 1599 complete and 0 interrupted iterations
default   [  47% ] 100 VUs  2m20.0s/5m0s

running (2m21.0s), 100/100 VUs, 1613 complete and 0 interrupted iterations
default   [  47% ] 100 VUs  2m21.0s/5m0s

running (2m22.0s), 100/100 VUs, 1625 complete and 0 interrupted iterations
default   [  47% ] 100 VUs  2m22.0s/5m0s

running (2m23.0s), 100/100 VUs, 1635 complete and 0 interrupted iterations
default   [  48% ] 100 VUs  2m23.0s/5m0s

running (2m24.0s), 100/100 VUs, 1645 complete and 0 interrupted iterations
default   [  48% ] 100 VUs  2m24.0s/5m0s

running (2m25.0s), 100/100 VUs, 1655 complete and 0 interrupted iterations
default   [  48% ] 100 VUs  2m25.0s/5m0s

running (2m26.0s), 100/100 VUs, 1671 complete and 0 interrupted iterations
default   [  49% ] 100 VUs  2m26.0s/5m0s

running (2m27.0s), 100/100 VUs, 1685 complete and 0 interrupted iterations
default   [  49% ] 100 VUs  2m27.0s/5m0s

running (2m28.0s), 100/100 VUs, 1695 complete and 0 interrupted iterations
default   [  49% ] 100 VUs  2m28.0s/5m0s

running (2m29.0s), 100/100 VUs, 1709 complete and 0 interrupted iterations
default   [  50% ] 100 VUs  2m29.0s/5m0s

running (2m30.0s), 100/100 VUs, 1725 complete and 0 interrupted iterations
default   [  50% ] 100 VUs  2m30.0s/5m0s

running (2m31.0s), 100/100 VUs, 1735 complete and 0 interrupted iterations
default   [  50% ] 100 VUs  2m31.0s/5m0s

running (2m32.0s), 100/100 VUs, 1745 complete and 0 interrupted iterations
default   [  51% ] 100 VUs  2m32.0s/5m0s

running (2m33.0s), 100/100 VUs, 1756 complete and 0 interrupted iterations
default   [  51% ] 100 VUs  2m33.0s/5m0s

running (2m34.0s), 100/100 VUs, 1768 complete and 0 interrupted iterations
default   [  51% ] 100 VUs  2m34.0s/5m0s

running (2m35.0s), 100/100 VUs, 1783 complete and 0 interrupted iterations
default   [  52% ] 100 VUs  2m35.0s/5m0s

running (2m36.0s), 100/100 VUs, 1795 complete and 0 interrupted iterations
default   [  52% ] 100 VUs  2m36.0s/5m0s

running (2m37.0s), 100/100 VUs, 1805 complete and 0 interrupted iterations
default   [  52% ] 100 VUs  2m37.0s/5m0s

running (2m38.0s), 100/100 VUs, 1815 complete and 0 interrupted iterations
default   [  53% ] 100 VUs  2m38.0s/5m0s

running (2m39.0s), 100/100 VUs, 1826 complete and 0 interrupted iterations
default   [  53% ] 100 VUs  2m39.0s/5m0s

running (2m40.0s), 100/100 VUs, 1845 complete and 0 interrupted iterations
default   [  53% ] 100 VUs  2m40.0s/5m0s

running (2m41.0s), 100/100 VUs, 1855 complete and 0 interrupted iterations
default   [  54% ] 100 VUs  2m41.0s/5m0s

running (2m42.0s), 100/100 VUs, 1866 complete and 0 interrupted iterations
default   [  54% ] 100 VUs  2m42.0s/5m0s

running (2m43.0s), 100/100 VUs, 1885 complete and 0 interrupted iterations
default   [  54% ] 100 VUs  2m43.0s/5m0s

running (2m44.0s), 100/100 VUs, 1895 complete and 0 interrupted iterations
default   [  55% ] 100 VUs  2m44.0s/5m0s

running (2m45.0s), 100/100 VUs, 1905 complete and 0 interrupted iterations
default   [  55% ] 100 VUs  2m45.0s/5m0s

running (2m46.0s), 100/100 VUs, 1917 complete and 0 interrupted iterations
default   [  55% ] 100 VUs  2m46.0s/5m0s

running (2m47.0s), 100/100 VUs, 1935 complete and 0 interrupted iterations
default   [  56% ] 100 VUs  2m47.0s/5m0s

running (2m48.0s), 100/100 VUs, 1945 complete and 0 interrupted iterations
default   [  56% ] 100 VUs  2m48.0s/5m0s

running (2m49.0s), 100/100 VUs, 1955 complete and 0 interrupted iterations
default   [  56% ] 100 VUs  2m49.0s/5m0s

running (2m50.0s), 100/100 VUs, 1965 complete and 0 interrupted iterations
default   [  57% ] 100 VUs  2m50.0s/5m0s

running (2m51.0s), 100/100 VUs, 1975 complete and 0 interrupted iterations
default   [  57% ] 100 VUs  2m51.0s/5m0s

running (2m52.0s), 100/100 VUs, 1985 complete and 0 interrupted iterations
default   [  57% ] 100 VUs  2m52.0s/5m0s

running (2m53.0s), 100/100 VUs, 1996 complete and 0 interrupted iterations
default   [  58% ] 100 VUs  2m53.0s/5m0s

running (2m54.0s), 100/100 VUs, 2014 complete and 0 interrupted iterations
default   [  58% ] 100 VUs  2m54.0s/5m0s

running (2m55.0s), 100/100 VUs, 2024 complete and 0 interrupted iterations
default   [  58% ] 100 VUs  2m55.0s/5m0s

running (2m56.0s), 100/100 VUs, 2034 complete and 0 interrupted iterations
default   [  59% ] 100 VUs  2m56.0s/5m0s

running (2m57.0s), 100/100 VUs, 2045 complete and 0 interrupted iterations
default   [  59% ] 100 VUs  2m57.0s/5m0s

running (2m58.0s), 100/100 VUs, 2054 complete and 0 interrupted iterations
default   [  59% ] 100 VUs  2m58.0s/5m0s

running (2m59.0s), 100/100 VUs, 2065 complete and 0 interrupted iterations
default   [  60% ] 100 VUs  2m59.0s/5m0s

running (3m00.0s), 100/100 VUs, 2079 complete and 0 interrupted iterations
default   [  60% ] 100 VUs  3m00.0s/5m0s

running (3m01.0s), 100/100 VUs, 2092 complete and 0 interrupted iterations
default   [  60% ] 100 VUs  3m01.0s/5m0s

running (3m02.0s), 100/100 VUs, 2104 complete and 0 interrupted iterations
default   [  61% ] 100 VUs  3m02.0s/5m0s

running (3m03.0s), 100/100 VUs, 2114 complete and 0 interrupted iterations
default   [  61% ] 100 VUs  3m03.0s/5m0s

running (3m04.0s), 100/100 VUs, 2125 complete and 0 interrupted iterations
default   [  61% ] 100 VUs  3m04.0s/5m0s

running (3m05.0s), 100/100 VUs, 2144 complete and 0 interrupted iterations
default   [  62% ] 100 VUs  3m05.0s/5m0s

running (3m06.0s), 100/100 VUs, 2154 complete and 0 interrupted iterations
default   [  62% ] 100 VUs  3m06.0s/5m0s

running (3m07.0s), 100/100 VUs, 2164 complete and 0 interrupted iterations
default   [  62% ] 100 VUs  3m07.0s/5m0s

running (3m08.0s), 100/100 VUs, 2175 complete and 0 interrupted iterations
default   [  63% ] 100 VUs  3m08.0s/5m0s

running (3m09.0s), 100/100 VUs, 2193 complete and 0 interrupted iterations
default   [  63% ] 100 VUs  3m09.0s/5m0s

running (3m10.0s), 100/100 VUs, 2204 complete and 0 interrupted iterations
default   [  63% ] 100 VUs  3m10.0s/5m0s

running (3m11.0s), 100/100 VUs, 2214 complete and 0 interrupted iterations
default   [  64% ] 100 VUs  3m11.0s/5m0s

running (3m12.0s), 100/100 VUs, 2224 complete and 0 interrupted iterations
default   [  64% ] 100 VUs  3m12.0s/5m0s

running (3m13.0s), 100/100 VUs, 2242 complete and 0 interrupted iterations
default   [  64% ] 100 VUs  3m13.0s/5m0s

running (3m14.0s), 100/100 VUs, 2254 complete and 0 interrupted iterations
default   [  65% ] 100 VUs  3m14.0s/5m0s

running (3m15.0s), 100/100 VUs, 2264 complete and 0 interrupted iterations
default   [  65% ] 100 VUs  3m15.0s/5m0s

running (3m16.0s), 100/100 VUs, 2274 complete and 0 interrupted iterations
default   [  65% ] 100 VUs  3m16.0s/5m0s

running (3m17.0s), 100/100 VUs, 2284 complete and 0 interrupted iterations
default   [  66% ] 100 VUs  3m17.0s/5m0s

running (3m18.0s), 100/100 VUs, 2304 complete and 0 interrupted iterations
default   [  66% ] 100 VUs  3m18.0s/5m0s

running (3m19.0s), 100/100 VUs, 2314 complete and 0 interrupted iterations
default   [  66% ] 100 VUs  3m19.0s/5m0s

running (3m20.0s), 100/100 VUs, 2324 complete and 0 interrupted iterations
default   [  67% ] 100 VUs  3m20.0s/5m0s

running (3m21.0s), 100/100 VUs, 2342 complete and 0 interrupted iterations
default   [  67% ] 100 VUs  3m21.0s/5m0s

running (3m22.0s), 100/100 VUs, 2354 complete and 0 interrupted iterations
default   [  67% ] 100 VUs  3m22.0s/5m0s

running (3m23.0s), 100/100 VUs, 2364 complete and 0 interrupted iterations
default   [  68% ] 100 VUs  3m23.0s/5m0s

running (3m24.0s), 100/100 VUs, 2381 complete and 0 interrupted iterations
default   [  68% ] 100 VUs  3m24.0s/5m0s

running (3m25.0s), 100/100 VUs, 2394 complete and 0 interrupted iterations
default   [  68% ] 100 VUs  3m25.0s/5m0s

running (3m26.0s), 100/100 VUs, 2404 complete and 0 interrupted iterations
default   [  69% ] 100 VUs  3m26.0s/5m0s

running (3m27.0s), 100/100 VUs, 2414 complete and 0 interrupted iterations
default   [  69% ] 100 VUs  3m27.0s/5m0s

running (3m28.0s), 100/100 VUs, 2433 complete and 0 interrupted iterations
default   [  69% ] 100 VUs  3m28.0s/5m0s

running (3m29.0s), 100/100 VUs, 2444 complete and 0 interrupted iterations
default   [  70% ] 100 VUs  3m29.0s/5m0s

running (3m30.0s), 100/100 VUs, 2454 complete and 0 interrupted iterations
default   [  70% ] 100 VUs  3m30.0s/5m0s

running (3m31.0s), 100/100 VUs, 2470 complete and 0 interrupted iterations
default   [  70% ] 100 VUs  3m31.0s/5m0s

running (3m32.0s), 100/100 VUs, 2484 complete and 0 interrupted iterations
default   [  71% ] 100 VUs  3m32.0s/5m0s

running (3m33.0s), 100/100 VUs, 2494 complete and 0 interrupted iterations
default   [  71% ] 100 VUs  3m33.0s/5m0s

running (3m34.0s), 100/100 VUs, 2504 complete and 0 interrupted iterations
default   [  71% ] 100 VUs  3m34.0s/5m0s

running (3m35.0s), 100/100 VUs, 2524 complete and 0 interrupted iterations
default   [  72% ] 100 VUs  3m35.0s/5m0s

running (3m36.0s), 100/100 VUs, 2534 complete and 0 interrupted iterations
default   [  72% ] 100 VUs  3m36.0s/5m0s

running (3m37.0s), 100/100 VUs, 2544 complete and 0 interrupted iterations
default   [  72% ] 100 VUs  3m37.0s/5m0s

running (3m38.0s), 100/100 VUs, 2564 complete and 0 interrupted iterations
default   [  73% ] 100 VUs  3m38.0s/5m0s

running (3m39.0s), 100/100 VUs, 2574 complete and 0 interrupted iterations
default   [  73% ] 100 VUs  3m39.0s/5m0s

running (3m40.0s), 100/100 VUs, 2584 complete and 0 interrupted iterations
default   [  73% ] 100 VUs  3m40.0s/5m0s

running (3m41.0s), 100/100 VUs, 2594 complete and 0 interrupted iterations
default   [  74% ] 100 VUs  3m41.0s/5m0s

running (3m42.0s), 100/100 VUs, 2614 complete and 0 interrupted iterations
default   [  74% ] 100 VUs  3m42.0s/5m0s

running (3m43.0s), 100/100 VUs, 2624 complete and 0 interrupted iterations
default   [  74% ] 100 VUs  3m43.0s/5m0s

running (3m44.0s), 100/100 VUs, 2634 complete and 0 interrupted iterations
default   [  75% ] 100 VUs  3m44.0s/5m0s

running (3m45.0s), 100/100 VUs, 2646 complete and 0 interrupted iterations
default   [  75% ] 100 VUs  3m45.0s/5m0s

running (3m46.0s), 100/100 VUs, 2664 complete and 0 interrupted iterations
default   [  75% ] 100 VUs  3m46.0s/5m0s

running (3m47.0s), 100/100 VUs, 2674 complete and 0 interrupted iterations
default   [  76% ] 100 VUs  3m47.0s/5m0s

running (3m48.0s), 100/100 VUs, 2684 complete and 0 interrupted iterations
default   [  76% ] 100 VUs  3m48.0s/5m0s

running (3m49.0s), 100/100 VUs, 2704 complete and 0 interrupted iterations
default   [  76% ] 100 VUs  3m49.0s/5m0s

running (3m50.0s), 100/100 VUs, 2714 complete and 0 interrupted iterations
default   [  77% ] 100 VUs  3m50.0s/5m0s

running (3m51.0s), 100/100 VUs, 2724 complete and 0 interrupted iterations
default   [  77% ] 100 VUs  3m51.0s/5m0s

running (3m52.0s), 100/100 VUs, 2740 complete and 0 interrupted iterations
default   [  77% ] 100 VUs  3m52.0s/5m0s

running (3m53.0s), 100/100 VUs, 2754 complete and 0 interrupted iterations
default   [  78% ] 100 VUs  3m53.0s/5m0s

running (3m54.0s), 100/100 VUs, 2764 complete and 0 interrupted iterations
default   [  78% ] 100 VUs  3m54.0s/5m0s

running (3m55.0s), 100/100 VUs, 2784 complete and 0 interrupted iterations
default   [  78% ] 100 VUs  3m55.0s/5m0s

running (3m56.0s), 100/100 VUs, 2794 complete and 0 interrupted iterations
default   [  79% ] 100 VUs  3m56.0s/5m0s

running (3m57.0s), 100/100 VUs, 2804 complete and 0 interrupted iterations
default   [  79% ] 100 VUs  3m57.0s/5m0s

running (3m58.0s), 100/100 VUs, 2814 complete and 0 interrupted iterations
default   [  79% ] 100 VUs  3m58.0s/5m0s

running (3m59.0s), 100/100 VUs, 2834 complete and 0 interrupted iterations
default   [  80% ] 100 VUs  3m59.0s/5m0s

running (4m00.0s), 100/100 VUs, 2844 complete and 0 interrupted iterations
default   [  80% ] 100 VUs  4m00.0s/5m0s

running (4m01.0s), 100/100 VUs, 2854 complete and 0 interrupted iterations
default   [  80% ] 100 VUs  4m01.0s/5m0s

running (4m02.0s), 100/100 VUs, 2873 complete and 0 interrupted iterations
default   [  81% ] 100 VUs  4m02.0s/5m0s

running (4m03.0s), 100/100 VUs, 2884 complete and 0 interrupted iterations
default   [  81% ] 100 VUs  4m03.0s/5m0s

running (4m04.0s), 100/100 VUs, 2894 complete and 0 interrupted iterations
default   [  81% ] 100 VUs  4m04.0s/5m0s

running (4m05.0s), 100/100 VUs, 2913 complete and 0 interrupted iterations
default   [  82% ] 100 VUs  4m05.0s/5m0s

running (4m06.0s), 100/100 VUs, 2924 complete and 0 interrupted iterations
default   [  82% ] 100 VUs  4m06.0s/5m0s

running (4m07.0s), 100/100 VUs, 2934 complete and 0 interrupted iterations
default   [  82% ] 100 VUs  4m07.0s/5m0s

running (4m08.0s), 100/100 VUs, 2953 complete and 0 interrupted iterations
default   [  83% ] 100 VUs  4m08.0s/5m0s

running (4m09.0s), 100/100 VUs, 2964 complete and 0 interrupted iterations
default   [  83% ] 100 VUs  4m09.0s/5m0s

running (4m10.0s), 100/100 VUs, 2974 complete and 0 interrupted iterations
default   [  83% ] 100 VUs  4m10.0s/5m0s

running (4m11.0s), 100/100 VUs, 2994 complete and 0 interrupted iterations
default   [  84% ] 100 VUs  4m11.0s/5m0s

running (4m12.0s), 100/100 VUs, 3004 complete and 0 interrupted iterations
default   [  84% ] 100 VUs  4m12.0s/5m0s

running (4m13.0s), 100/100 VUs, 3014 complete and 0 interrupted iterations
default   [  84% ] 100 VUs  4m13.0s/5m0s

running (4m14.0s), 100/100 VUs, 3029 complete and 0 interrupted iterations
default   [  85% ] 100 VUs  4m14.0s/5m0s

running (4m15.0s), 100/100 VUs, 3044 complete and 0 interrupted iterations
default   [  85% ] 100 VUs  4m15.0s/5m0s

running (4m16.0s), 100/100 VUs, 3054 complete and 0 interrupted iterations
default   [  85% ] 100 VUs  4m16.0s/5m0s

running (4m17.0s), 100/100 VUs, 3068 complete and 0 interrupted iterations
default   [  86% ] 100 VUs  4m17.0s/5m0s

running (4m18.0s), 100/100 VUs, 3084 complete and 0 interrupted iterations
default   [  86% ] 100 VUs  4m18.0s/5m0s

running (4m19.0s), 100/100 VUs, 3094 complete and 0 interrupted iterations
default   [  86% ] 100 VUs  4m19.0s/5m0s

running (4m20.0s), 100/100 VUs, 3104 complete and 0 interrupted iterations
default   [  87% ] 100 VUs  4m20.0s/5m0s

running (4m21.0s), 100/100 VUs, 3123 complete and 0 interrupted iterations
default   [  87% ] 100 VUs  4m21.0s/5m0s

running (4m22.0s), 100/100 VUs, 3134 complete and 0 interrupted iterations
default   [  87% ] 100 VUs  4m22.0s/5m0s

running (4m23.0s), 100/100 VUs, 3144 complete and 0 interrupted iterations
default   [  88% ] 100 VUs  4m23.0s/5m0s

running (4m24.0s), 100/100 VUs, 3154 complete and 0 interrupted iterations
default   [  88% ] 100 VUs  4m24.0s/5m0s

running (4m25.0s), 100/100 VUs, 3174 complete and 0 interrupted iterations
default   [  88% ] 100 VUs  4m25.0s/5m0s

running (4m26.0s), 100/100 VUs, 3184 complete and 0 interrupted iterations
default   [  89% ] 100 VUs  4m26.0s/5m0s

running (4m27.0s), 100/100 VUs, 3194 complete and 0 interrupted iterations
default   [  89% ] 100 VUs  4m27.0s/5m0s

running (4m28.0s), 100/100 VUs, 3204 complete and 0 interrupted iterations
default   [  89% ] 100 VUs  4m28.0s/5m0s

running (4m29.0s), 100/100 VUs, 3224 complete and 0 interrupted iterations
default   [  90% ] 100 VUs  4m29.0s/5m0s

running (4m30.0s), 100/100 VUs, 3234 complete and 0 interrupted iterations
default   [  90% ] 100 VUs  4m30.0s/5m0s

running (4m31.0s), 100/100 VUs, 3244 complete and 0 interrupted iterations
default   [  90% ] 100 VUs  4m31.0s/5m0s

running (4m32.0s), 100/100 VUs, 3263 complete and 0 interrupted iterations
default   [  91% ] 100 VUs  4m32.0s/5m0s

running (4m33.0s), 100/100 VUs, 3274 complete and 0 interrupted iterations
default   [  91% ] 100 VUs  4m33.0s/5m0s

running (4m34.0s), 100/100 VUs, 3284 complete and 0 interrupted iterations
default   [  91% ] 100 VUs  4m34.0s/5m0s

running (4m35.0s), 100/100 VUs, 3301 complete and 0 interrupted iterations
default   [  92% ] 100 VUs  4m35.0s/5m0s

running (4m36.0s), 100/100 VUs, 3314 complete and 0 interrupted iterations
default   [  92% ] 100 VUs  4m36.0s/5m0s

running (4m37.0s), 100/100 VUs, 3324 complete and 0 interrupted iterations
default   [  92% ] 100 VUs  4m37.0s/5m0s

running (4m38.0s), 100/100 VUs, 3342 complete and 0 interrupted iterations
default   [  93% ] 100 VUs  4m38.0s/5m0s

running (4m39.0s), 100/100 VUs, 3354 complete and 0 interrupted iterations
default   [  93% ] 100 VUs  4m39.0s/5m0s

running (4m40.0s), 100/100 VUs, 3364 complete and 0 interrupted iterations
default   [  93% ] 100 VUs  4m40.0s/5m0s

running (4m41.0s), 100/100 VUs, 3374 complete and 0 interrupted iterations
default   [  94% ] 100 VUs  4m41.0s/5m0s

running (4m42.0s), 100/100 VUs, 3394 complete and 0 interrupted iterations
default   [  94% ] 100 VUs  4m42.0s/5m0s

running (4m43.0s), 100/100 VUs, 3404 complete and 0 interrupted iterations
default   [  94% ] 100 VUs  4m43.0s/5m0s

running (4m44.0s), 100/100 VUs, 3415 complete and 0 interrupted iterations
default   [  95% ] 100 VUs  4m44.0s/5m0s

running (4m45.0s), 100/100 VUs, 3434 complete and 0 interrupted iterations
default   [  95% ] 100 VUs  4m45.0s/5m0s

running (4m46.0s), 100/100 VUs, 3444 complete and 0 interrupted iterations
default   [  95% ] 100 VUs  4m46.0s/5m0s

running (4m47.0s), 100/100 VUs, 3454 complete and 0 interrupted iterations
default   [  96% ] 100 VUs  4m47.0s/5m0s

running (4m48.0s), 100/100 VUs, 3474 complete and 0 interrupted iterations
default   [  96% ] 100 VUs  4m48.0s/5m0s

running (4m49.0s), 100/100 VUs, 3484 complete and 0 interrupted iterations
default   [  96% ] 100 VUs  4m49.0s/5m0s

running (4m50.0s), 100/100 VUs, 3494 complete and 0 interrupted iterations
default   [  97% ] 100 VUs  4m50.0s/5m0s

running (4m51.0s), 100/100 VUs, 3511 complete and 0 interrupted iterations
default   [  97% ] 100 VUs  4m51.0s/5m0s

running (4m52.0s), 100/100 VUs, 3524 complete and 0 interrupted iterations
default   [  97% ] 100 VUs  4m52.0s/5m0s

running (4m53.0s), 100/100 VUs, 3534 complete and 0 interrupted iterations
default   [  98% ] 100 VUs  4m53.0s/5m0s

running (4m54.0s), 100/100 VUs, 3545 complete and 0 interrupted iterations
default   [  98% ] 100 VUs  4m54.0s/5m0s

running (4m55.0s), 100/100 VUs, 3564 complete and 0 interrupted iterations
default   [  98% ] 100 VUs  4m55.0s/5m0s

running (4m56.0s), 100/100 VUs, 3574 complete and 0 interrupted iterations
default   [  99% ] 100 VUs  4m56.0s/5m0s

running (4m57.0s), 100/100 VUs, 3584 complete and 0 interrupted iterations
default   [  99% ] 100 VUs  4m57.0s/5m0s

running (4m58.0s), 100/100 VUs, 3603 complete and 0 interrupted iterations
default   [  99% ] 100 VUs  4m58.0s/5m0s

running (4m59.0s), 100/100 VUs, 3614 complete and 0 interrupted iterations
default   [ 100% ] 100 VUs  4m59.0s/5m0s

running (5m00.0s), 100/100 VUs, 3624 complete and 0 interrupted iterations
default   [ 100% ] 100 VUs  5m00.0s/5m0s

running (5m01.0s), 090/100 VUs, 3634 complete and 0 interrupted iterations
default ↓ [ 100% ] 100 VUs  5m0s

running (5m02.0s), 070/100 VUs, 3654 complete and 0 interrupted iterations
default ↓ [ 100% ] 100 VUs  5m0s

running (5m03.0s), 060/100 VUs, 3664 complete and 0 interrupted iterations
default ↓ [ 100% ] 100 VUs  5m0s

running (5m04.0s), 050/100 VUs, 3674 complete and 0 interrupted iterations
default ↓ [ 100% ] 100 VUs  5m0s

running (5m05.0s), 030/100 VUs, 3694 complete and 0 interrupted iterations
default ↓ [ 100% ] 100 VUs  5m0s

running (5m06.0s), 020/100 VUs, 3704 complete and 0 interrupted iterations
default ↓ [ 100% ] 100 VUs  5m0s

running (5m07.0s), 002/100 VUs, 3722 complete and 0 interrupted iterations
default ↓ [ 100% ] 100 VUs  5m0s


  █ THRESHOLDS 

    http_req_duration
    ✗ 'p(95)<2000' p(95)=3.75s


  █ TOTAL RESULTS 

    HTTP
    http_req_duration..............: avg=1.71s min=1.78ms med=2.05s max=7.95s  p(90)=3.33s p(95)=3.75s
      { expected_response:true }...: avg=1.71s min=1.78ms med=2.05s max=7.95s  p(90)=3.33s p(95)=3.75s
    http_req_failed................: 0.00%  0 out of 11172
    http_reqs......................: 11172  36.384772/s

    EXECUTION
    iteration_duration.............: avg=8.15s min=4.11s  med=8.05s max=13.05s p(90)=8.94s p(95)=9.48s
    iterations.....................: 3724   12.128257/s
    vus............................: 2      min=2          max=100
    vus_max........................: 100    min=100        max=100

    NETWORK
    data_received..................: 457 MB 1.5 MB/s
    data_sent......................: 3.3 MB 11 kB/s



running (5m07.1s), 000/100 VUs, 3724 complete and 0 interrupted iterations
default ✓ [ 100% ] 100 VUs  5m0s
time="2026-04-30T09:36:46Z" level=error msg="thresholds on metrics 'http_req_duration' have been crossed"